УправлениеДомашнимиРасходами/src/Documents/УчетЗатратИПоступлений/УчетЗатратИПоступлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УчетЗатратИПоступлений</name>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>InformationRegister.ЦеныНамеклатуры</registerRecords>
  <tabularSections>
    <name>ЗатратыИПоступления</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗатратаПоступление</name>
      <type>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдинцаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеДомашнимиРасходами/src/AccumulationRegisters/ДоходыИРасходы/ДоходыИРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДоходыИРасходы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоходыРасходы</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправлениеДомашнимиРасходами/src/InformationRegisters/ЦеныНамеклатуры/ЦеныНамеклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНамеклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>Номеклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеДомашнимиРасходами/src/Documents/УчетЗатратИПоступлений/ObjectModule.bsl
// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
		Движения.ДоходыИРасходы.Записывать = Истина;
	Для Каждого ТекСтрокаЗатраты из ЗатратыИПоступления Цикл
		Движение = Движения.ДоходыИРасходы.Добавить();
		Движение.Период = ТекСтрокаЗатраты.Дата;
		
		Если ТипЗнч(ТекСтрокаЗатраты.ЗатратаПоступление) = Тип("СправочникСсылка.ИсточникиДенежныхСредств") Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли; 
		
		Движение.Основание = Ссылка;
		Движение.ДоходыРасходы = ТекСтрокаЗатраты.ЗатратаПоступление;
		Движение.Сумма = ТекСтрокаЗатраты.Сумма;
	КонецЦикла;

	Движения.ЦеныНамеклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаЗатраты из ЗатратыИПоступления Цикл
		Движение_1 = Движения.ЦеныНамеклатуры.Добавить();
		Движение_1.Период = ТекСтрокаЗатраты.Дата;
		//@skip-check statement-type-change
		Движение_1.Номеклатура = ТекСтрокаЗатраты.ЗатратаПоступление;
		Движение_1.Цена = ТекСтрокаЗатраты.Цена;
		Движение_1.Количество = ТекСтрокаЗатраты.Количество;
		Движение_1.ЕдиницаИзмерения = ТекСтрокаЗатраты.ЕдинцаИзмерения;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
